CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC6 (number 111), CAM_VSNC
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_VSNC_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_VSNC_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_VSNC_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_VSNC_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_VSNC_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC8 (number 113), CAM_D_0
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_0_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_0_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_0_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC9 (number 114), CAM_D_1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_1_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC10 (number 115), CAM_D_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_2_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC11 (number 116), CAM_D_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_3_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC14 (number 119), CAM_D_6
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_6_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_6_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_6_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_6_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_6_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC13 (number 118), CAM_D_5
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_5_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_5_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_5_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC12 (number 117), CAM_D_4
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_4_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_4_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_4_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC15 (number 120), CAM_D_7
  @{ */

